{
  "list": [
    {
      "Nhân vật liên quan": [
        "Nguyễn Hữu Cảnh "
      ],
      "name": "Chúa Nguyễn sai Nguyễn Hữu Cảnh vào miền Nam (1698 )",
      "description": "Trên cơ sở những lưu dân Việt đã tự phát tới khu vực này trước đó, Nguyễn Hữu Cảnh cho lập phủ Gia Định và hai huyện Phước Long, Tân Bình. Vùng Nam Bộ được sát nhập vào cương vực Việt Nam",
      "Địa điểm liên quan": [
        "Gia Định "
      ]
    },
    {
      "name": "Nhà nước Văn Lang ra đời (-700 )",
      "description": "Văn Lang là nhà nước đầu tiên của Việt Nam trong lịch sử. Nhà nước Văn Lang được cai trị bởi các vua Hùng. Đứng đầu nhà nước là Hùng Vương, chia nước làm 15 bộ, vua giữ mọi quyền hành trong nước, tường văn là là Lạc Hầu, tướng võ là Lạc Tướng. Con trai vua là Quan Lang, con gái vua là Mị Nương. Các vị vua cai trị nước Văn Lang có tất cả 18 đời vua đều gọi là Hùng Vương.",
      "Địa điểm liên quan": [
        "Tây Bắc",
        "Đông Bắc"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Trung Trực "
      ],
      "name": "Khởi nghĩa của Nguyễn Trung Trực (1861 )",
      "description": "Ngay sau khi nổ súng xâm lược nước ta, thực dân Pháp đã vấp phải sự phản kháng của các tầng lớp nhân dân Việt Nam, nhất là giai đoạn nửa sau thế kỷ XIX, trong đó Nguyễn Trung Trực là một trong những người yêu nước tiêu biểu và đặc biệt. Ông đã tham gia chống Pháp từ những năm đầu tiên Pháp tiến hành xâm lược Việt Nam với hai chiến công lừng lẫy: đốt cháy tàu L’ Espérance- tàu Hy Vọng của Pháp trên sông Nhật Tảo và trận đánh tiêu diệt đồn Rạch Giá, Kiên Giang."
    },
    {
      "Nhân vật liên quan": [
        "Ngô Quyền "
      ],
      "name": "Ngô Quyền xưng vương, đóng đô ở Cổ Loa (939 )",
      "description": "Sau chiến thắng Bạch Đằng năm 938, mưu đồ xâm lược của quân Nam Hán bị đè bẹp, Việt Nam chính thức kết thúc hơn một thiên niên kỉ Bắc thuộc, mở ra một thời kì độc lập lâu dài. Sau chiến thắng này, năm 939 Ngô Quyền lên ngôi vua, chọn Cổ Loa làm kinh đô.",
      "Địa điểm liên quan": [
        "Cổ Loa"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh "
      ],
      "name": "Nguyễn Ái Quốc tham dự Đại hội lần thứ 18 của Đảng Xã hội Pháp (1920 - 1920)",
      "description": "Nguyễn Ái Quốc tham gia Đại hội đại biểu toàn quốc lần thứ XVIII Đảng Xã hội Pháp với tư cách là đại biểu Đông Dương. Đại hội khai mạc lúc 10 giờ 35 phút ngày 25-12-1920 tại phòng họp lớn của nhà Mane ở thành phố Tua (Tours), cách Pari 237km. Lần đầu tiên có một người Việt Nam tham gia một đại hội đại biểu của một chính đảng Pháp. Nguyễn Ái Quốc cũng là người bản xứ duy nhất trong số đại biểu các thuộc địa có mặt trong đại hội."
    },
    {
      "Nhân vật liên quan": [
        "Khúc Hạo ",
        "Khúc Thừa Mĩ",
        "Dương Đình Nghệ "
      ],
      "name": "Kháng chiến chống quân Nam Hán lần thứ nhất (930 - 931)",
      "description": "Năm 917, Khúc Hạo mất, Khúc Thừa Mĩ lên thay. Tiếp tục sự nghiệp của cha, Khúc Thừa Mĩ đã cử quân sang thần phục nhà Hậu Lương và được vua Lương phong chức Tiết độ sứ. Viện cớ này, năm 930, quân Nam Hán đánh sang nước ta. Khúc Thừa Mĩ chống cự không nổi bị bắt đem về Quảng Châu. Nhà Nam Hán nhân đó cử Lý Tiến làm Thứ sử Giao Châu, đặt cơ quan đô hộ ở Tống Bình (Hà Nội). Năm 931, một tướng cũ của Khúc Hạo là Dương Đình Nghệ được tin đã kéo quân từ Thanh Hoá ra Bắc, bao vây thành Tống Bình"
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh "
      ],
      "name": "Tờ báo “Người cùng khổ” ra số đầu tiên tại Pari do Nguyễn Ái Quốc làm chủ nhiệm (1922 )",
      "description": "Vào tháng 1/1922, để xây dựng một diễn đàn của nhân dân các nước thuộc địa và tạo ra một hình thức đấu tranh mới, Nguyễn Ái Quốc và Ban thường vụ Hội Liên hiệp thuộc địa đã thống nhất quyết định thành lập “Hội hợp tác Người cùng khổ” và ra tờ báo “Người cùng khổ” hay \"Le Paria\". Ngày 1/4/1922 báo ra số đầu tiên bằng ba thứ tiếng Pháp, Ả rập và Trung Quốc. Đầu tiên báo lấy tiêu đề “Diễn đàn của các dân tộc thuộc địa”, sau đổi là “Diễn đàn của vô sản thuộc địa”, rồi sau lại đổi là “Cơ quan của nhân dân bị áp bức các thuộc địa”. Đây là lần đầu tiên nhân dân của nhiều nước thuộc địa khác nhau có một tổ chức và một tiếng nói đấu tranh chung."
    },
    {
      "name": "Ngày Quốc Tế Phụ Nữ (1910 )",
      "description": "Ngày Quốc tế Phụ nữ hay còn gọi là Ngày Liên Hiệp Quốc vì Nữ quyền và Hòa bình Quốc tế được Liên Hiệp Quốc, đây là thành quả đấu tranh lâu dài và lặng lẽ của hàng triệu phụ nữ trên thế giới."
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Hữu Cầu "
      ],
      "name": "Khởi nghĩa Nguyễn Hữu Cầu (1471 - 1751)",
      "description": "Khởi nghĩa Nguyễn Hữu Cầu là một cuộc khởi nghĩa nông dân Đàng Ngoài lớn vào giữa thế kỷ 18. Cuộc khởi nghĩa xuất phát từ Đồ Sơn (Hải Phòng), di chuyển lên Kinh Bắc (Bắc Giang, Bắc Ninh), uy hiếp kinh thành Thăng Long rồi xuống Sơn Nam, vào Thanh Hóa, Nghệ An.",
      "Địa điểm liên quan": [
        "Thăng Long ",
        "Nghệ An",
        "Thanh Hóa",
        "Đàng Ngoài"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Nhạc ",
        "Nguyễn Lữ ",
        "Nguyễn Huệ "
      ],
      "name": "Khởi nghĩa nông dân Tây Sơn bùng nổ (1771 )",
      "description": "Từ giữa thế kỉ XVIII, chính quyền họ Nguyễn ở Đàng Trong suy yếu dần. Việc mua quan bán tước diễn ra phổ biến. Số quan lại ngày càng tăng, nhất là quan thu thuế. Quan lại, hào cường kết thành bè cánh, đàn áp bóc lột nhân dân thậm tệ và đua nhau ăn chơi xa xỉ. Nỗi bất bình oán hận của các tầng lớp xã hội với chính quyền họ Nguyễn ngày càng dâng cao. Mùa xuân năm 1771, ba anh em Nguyễn Nhạc, Nguyễn Huệ và Nguyễn Lữ lên vùng Tây Sơn thượng đạo (nay thuộc An Khê, Gia Lai) lập căn cứ, dụng cờ khởi nghĩa chống chính quyền họ Nguyễn.",
      "Địa điểm liên quan": [
        "Đàng Trong"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Nhạc ",
        "Nguyễn Lữ ",
        "Nguyễn Huệ ",
        "Gia Long "
      ],
      "name": "Nghĩa quân Tây Sơn lật đổ chính quyền chúa Nguyễn ở Đàng Trong (1777 )",
      "description": "Năm 1771, ba anh em Nguyễn Nhạc, Nguyễn Huệ, Nguyễn Lữ lên vùng Tây Sơn Thượng Đạo (thuộc huyện An Khê, Gia Lai) tập hợp lực lượng chuẩn bị khởi nghĩa. Mùa thu năm 1773, nghĩa quân đã kiểm soát phần lớn phủ Quy Nhơn. Chỉ trong vòng một năm (đến giữa năm 1774), nghĩa quân kiểm soát một vùng rộng lớn từ Quảng Nam ở phía bắc đến Bình Thuận ở phía Nam.",
      "Địa điểm liên quan": [
        "Gia Định ",
        "Đàng Trong",
        "Phú Xuân",
        "Huế"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Huệ ",
        "Gia Long "
      ],
      "name": "Chiến thắng Rạch Gầm – Xoài Mút (1785 )",
      "description": "Trận Rạch Gầm-Xoài Mút là một trận chiến lớn trên sông diễn ra vào đêm 19 rạng 20 tháng 1 năm 1785 giữa liên quân Xiêm-Nguyễn và quân Tây Sơn tại khúc sông Rạch Gầm-Xoài Mút, khi đó thuộc dinh Trấn Định, xứ Đàng Trong; nay thuộc Tiền Giang, Việt Nam. Đây là một trong những trận thủy chiến lớn nhất trong lịch sử chống ngoại xâm của nhân dân ta.",
      "Địa điểm liên quan": [
        "Rạch Gầm - Xoài Mút"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Nhạc ",
        "Nguyễn Huệ ",
        "Gia Long ",
        "Nguyễn Hữu Chỉnh "
      ],
      "name": "Tây Sơn lật đổ chính quyền họ Trịnh (1786 )",
      "description": "Sau khi đánh tan 5 vạn quân xâm lược Xiêm và đuổi Nguyễn Ánh khỏi đất Gia Định, Nguyễn Huệ được Nguyễn Nhạc giao nhiệm vụ chỉ huy quân Tây Sơn tiến đánh quân Trịnh ở Phú Xuân.",
      "Địa điểm liên quan": [
        "Gia Định ",
        "Thăng Long ",
        "Đàng Trong",
        "Đàng Ngoài",
        "Phú Xuân"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh "
      ],
      "name": "Nguyễn Ái Quốc sang Liên Xô dự hội nghị Quốc tế Nông dân (1923 )",
      "description": "Tháng 6-1923, Nguyễn Ái Quốc bí mật rời nước Pháp sang Matxcơva (Liên Xô) dự Hội nghị Quốc tế Nông Dân. Hội nghị diễn ra vào tháng 10 -1923 và Nguyễn Ái Quốc được bầu vào ban chấp hành hội. Người ở lại Liên Xô, vừa nghiên cứu vừa học tập, vừa viết bài cho báo Sự Thật của Đảng Cộng Sản Liên Xô, tạp chí Thư tín Quốc tế của Đảng Công sản. Tháng 7-1924 Người tham dự Đại hội V Quốc tế Cộng sản. Tại các đại hội đó, Người đã trình bày quan điểm của mình về vị trí chiến lược của cách mạng các nước thuộc địa, về mối quan hệ giữa phong trào công nhân ở các nước đế quốc với phong trào cách mạng ở các nước thuộc địa, về vai trò và sức mạnh to lớn của giai cấp nông dân ở các nước thuộc địa."
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Huệ ",
        "Nguyễn Hữu Chỉnh ",
        "Lê Chiêu Thống ",
        "Ngô Thì Nhậm ",
        "Phan Huy Ích ",
        "Võ Huy Tấn ",
        "Đặng Tiến Đông "
      ],
      "name": "Quân Thanh xâm lược nước ta (1788 )",
      "description": "Sau khi Nguyễn Huệ lật đổ chính quyền họ Trịnh và rút quân về Nam, tình hình Bắc Hà rối loạn. Vua Lê Chiêu Thống bất tài, dựa vào Nguyễn Hữu Chỉnh để đánh dẹp những cuộc nổi loạn của con cháu họ Trịnh, sau đó bị Chỉnh thao túng triều đình. Năm 1787, Nguyễn Huệ cử tướng Vũ Văn Nhậm ra diệt Chỉnh. Vũ Văn Nhậm lại kiêu căng và có mưu đồ riêng. Để ổn định tình hình Bắc Hà, tháng 5/1787, Nguyễn Huệ đích thân đem quân ra Bắc, vào thẳng dinh Bắc Trấn, trị tội Vũ Văn Nhậm.",
      "Địa điểm liên quan": [
        "Thăng Long ",
        "Đàng Ngoài"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh "
      ],
      "name": "Nguyễn Ái Quốc tham dự Đại hội II Đảng Cộng sản Pháp (1922 - 1922)",
      "description": "Từ ngày 21 đến 24 tháng 10 năm 1922, Nguyễn Ái Quốc tham dự Đại hội II Đảng Cộng sản Pháp họp tại nhà số 33 phố La Grănggiơ Ô Belơ, Quận 10, Pari. Tại đại hội này, Nguyễn Ái Quốc gặp Manuinxki, thay mặt Thường vụ Quốc tế Cộng sản tham dự đại hội. Từ diễn đàn đại hội, Nguyễn Ái Quốc đã phê bình Đảng Cộng sản Pháp chưa quan tâm đúng mức đến vấn đề công tác ở các thuộc địa. Theo đề nghị của Nguyễn Ái Quốc, đại hội đã thông qua lời kêu gọi Những người bản xứ ở các thuộc địa."
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Huệ ",
        "Lê Chiêu Thống ",
        "Tuyết",
        "Võ Văn Dũng",
        "Lộc",
        "Lê Văn Hưng",
        "Võ Đình Tú "
      ],
      "name": "Vua Quang Trung đại phá quân Thanh (1789 )",
      "description": "Năm 1787 vua Lê Chiêu Thống cầu cứu quân Thanh. Năm 1788, 29 quân Thanh ồ ạt tiến vào miền bắc nước ta. Nhận được tin cấp báo, Nguyễn Huệ lên ngôi Hoàng Đế, lấy niên hiệu là Quang Trung lập tức tiến quân ra Bắc",
      "Địa điểm liên quan": [
        "Thăng Long ",
        "Hà Nội",
        "Nghệ An"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Huệ "
      ],
      "name": "Quang Trung đột ngột qua đời (1792 )",
      "description": "Sau khi tiêu diệt chính quyền chúa Nguyễn, chúa Trịnh và đập tan 29 vạn quân Thanh. Vua Quang Trung đã thực hiện nhiều cuộc cải cách về kinh tế, chính trị, xã hội và lên kế hoạch nam tiến. Tuy nhiên ngày 29 tháng 7 năm Nhâm Tý (16 tháng 9 năm 1792), vào khoảng 11-12 giờ đêm, Quang Trung Nguyễn Huệ qua đời, ở ngôi được 4 năm, hưởng thọ 40 tuổi, miếu hiệu là Thái Tổ Vũ hoàng đế"
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Huệ ",
        "Gia Long "
      ],
      "name": "Nguyễn Ánh lên ngôi, triều đình nhà Nguyễn thành lập (1802 )",
      "description": "Năm 1775, lợi dụng sự suy sụp của triều đình chúa Nguyễn do cuộc khởi nghĩa Tây Sơn, quân Trịnh vào chiếm Phú Xuân khiến Nguyễn Phúc Ánh phải trốn vào Nam. Từ đó ông bôn tẩu gian nan, tìm đủ mọi cách chiêu tập lực lượng để giành lại vương quyền cho họ Nguyễn. Sau nhiều thất bại lớn và phải cầu viện sự giúp đỡ của Xiêm La và Pháp",
      "Địa điểm liên quan": [
        "Thuận Hóa",
        "Phú Xuân"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Gia Long "
      ],
      "name": "Gia Long đặt quốc hiệu là Việt Nam (1804 )",
      "description": "Quốc hiệu Việt Nam chính thức xuất hiện vào thời nhà Nguyễn. Vua Gia Long đã đề nghị nhà Thanh công nhận quốc hiệu Nam Việt, với lý lẽ rằng \"Nam\" có ý nghĩa \"An Nam\" còn \"Việt\" có ý nghĩa \"Việt Thường\". Tuy nhiên tên Nam Việt trùng với quốc hiệu của quốc gia cổ Nam Việt thời nhà Triệu, gồm cả Quảng Đông và Quảng Tây của Trung Hoa. Nhà Thanh yêu cầu nhà Nguyễn đổi ngược lại thành Việt Nam để tránh nhầm lẫn. Tháng 3 năm 1804, vua Gia Long đổi quốc hiệu nước ta là Việt Nam ."
    },
    {
      "Nhân vật liên quan": [
        "Gia Long "
      ],
      "name": "Ban hành bộ luật Hoàng triều luật lệ (1815 )",
      "description": "Hoàng Việt luật lệ hay còn được biết đến với tên Hoàng triều luật lệ, Quốc triều điều luật, Nguyễn triều hình luật, bộ luật Gia Long là bộ luật chính thức của Việt Nam thời đầu nhà Nguyễn do Bắc thành Tổng trấn Nguyễn Văn Thành soạn thảo và vua Gia Long cho ban hành năm 1815. Bộ luật này được biên soạn trên cơ sở tham khảo bộ luật của nhà Thanh và Bộ luật Hồng Đức (thời Lê Thánh Tông)."
    },
    {
      "Nhân vật liên quan": [
        "Triệu Đà "
      ],
      "name": "Nhà Hán đánh bại nhà Triệu, đô hộ Âu Lạc (-111 )",
      "description": "Triều đình nhà Hán phái một lực lượng hơn 10 vạn người do Vệ úy Lộ Bác Đức làm Phục ba tướng quân đem quân từ quận Quế Dương tiến xuống đường sông Hồi Thủy, chủ tước Đô úy là Dương Bộc làm Lâu thuyền tướng quân đem quân từ quận Dự Chương xuống đường Hoành Phố, Quy Nghĩa, cùng tiến xuống tấn công tiêu diệt nước Nam Việt của con cháu Triệu Đà, chiếm kinh đô Phiên Ngung (Quảng Châu ngày nay).",
      "Địa điểm liên quan": [
        "Nhật Nam",
        "Giao Chỉ",
        "Cửu Chân"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Minh Mạng "
      ],
      "name": "Minh Mạng lên ngôi Hoàng Đế (1820 )",
      "description": "Đầu năm 1820, vua Gia Long mất. Tháng giêng năm Canh Thìn (1820), Nguyễn Phúc Đảm lên nối ngôi, đặt niên hiệu là Minh Mạng. Trong thời gian ở ngôi, nhà vua đã có nhiều cải cách quan trọng: cho bỏ các dinh và trấn mà thành lập các tỉnh (cả nước được chia làm 31 tỉnh); định lại quan chế, đặt mức lương bổng của các quan tùy theo ngạch trật; thống nhất việc đo lường và thống nhất y phục; khuyến khích dân khai hoang lập ấp, sửa sang hệ thống giao thông, lập nhà Dưỡng tế ở các tỉnh để giúp đỡ những người nghèo khổ, tàn tật, già cả không nơi nương tựa. Thời vua Minh Mạng bờ cõi được mở rộng nhất trong lịch sử và Việt Nam thực sự trở thành một quốc gia hùng mạnh."
    },
    {
      "Nhân vật liên quan": [
        "Gia Long ",
        "Minh Mạng "
      ],
      "name": "Quốc hiệu Đại Nam (1838 )",
      "description": "Vương triều Nguyễn, quốc hiệu Việt Nam tồn tại trong thời gian 34 năm (1804 – 1838). Sau khi lên nối nghiệp vua Gia Long, vua Minh Mạng đã cho thay đổi quốc hiệu Đại Nam vào năm Minh Mạng thứ 19 (1838). Sự kiện này được phản ánh trong mộc bản triều Nguyễn và được xác nhận bằng một văn bản quan trọng là bản Dụ của vua Minh Mạng bố cáo cho toàn thần dân trong nước và các nước đều biết."
    },
    {
      "Nhân vật liên quan": [
        "Minh Mạng ",
        "Nguyễn Công Trứ ",
        "Phan Bá Vành "
      ],
      "name": "Khởi nghĩa Phan Bá Vành (1821 - 1827)",
      "description": "Khởi nghĩa Phan Bá Vành là cuộc khởi nghĩa nông dân ở Sơn Nam Hạ thời vua Minh Mạng, nhà Nguyễn nhằm chống lại đường lối cai trị của nhà Nguyễn ở nửa đầu thế kỷ 19 trong lịch sử Việt Nam. Vào thời vua Minh Mạng, ruộng đất tư tập trung gần 90%, trong một số đất trong tay địa chủ lớn có từ 5 đến 50 mẫu /điền chủ. Đại đa số nông dân nghèo không có ruộng đất, và cũng không có, hoặc có rất ít công điền quân cấp, lại bị tai họa bão lũ, đói kém triền miên, dẫn đến tình cảnh làng xã tiêu điều, dân nghèo tha phương cầu thực. Chế độ thống trị chuyên chế nặng nề. Bất mãn vì đường lối cai trị của nhà Nguyễn, khoảng năm 1821, Phan Bá Vành tập hợp dân nghèo khổ vùng Nam Định, Thái Bình (tức vùng Sơn Nam Hạ cũ) nổi dậy chống triều đình nhà Nguyễn."
    },
    {
      "Nhân vật liên quan": [
        "Gia Long ",
        "Minh Mạng "
      ],
      "name": "Nhà Nguyễn sắp xếp lại đơn vị hành chính trong cả nước (1831 - 1832)",
      "description": "Sau khi lật đổ nhà Lê Sơ, lên ngôi hoàng đế, năm 1802, vua Gia Long chọn Phú Xuân làm quốc đô, vẫn tạm đặt 11 trấn phía Bắc (tương đương khu vực Bắc Bộ ngày nay) thành một Tổng trấn với tên cũ Bắc Thành, do một Tổng trấn đứng đầu. Đến thời Minh Mạng, để nhất thể hóa các đơn vị hành chính trong cả nước, năm 1831-1832 nhà vua thực hiện một cuộc cải cách hành chính lớn, theo đó bỏ các tổng trấn, đổi các dinh, trấn thành tỉnh. Đây là lần đầu tiên đơn vị hành chính tỉnh xuất hiện ở Việt Nam.",
      "Địa điểm liên quan": [
        "Quảng Trị",
        "Phú Xuân"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Cao Bá Quát ",
        "Tự Đức "
      ],
      "name": "Khởi nghĩa Cao Bá Quát (1854 - 1856)",
      "description": "Đến giữa thế kỷ 19, nền kinh tế Việt Nam hết sức suy đốn trì trệ. Các nạn chiếm đoạt và tập trung ruộng đất của giới địa chủ, sự tham nhũng của nhiều quan lại, chế độ tô thuế và lao dịch khắc nghiệt; nạn bão lụt, hạn hán, ôn dịch và vỡ đê xảy ra liên miên. Tất cả đã đẩy người dân lao động xuống tận đáy khốn cùng. Do vậy khoảng thời gian từ 1847 đến 1862, tức trước khi vua Tự Đức ký Hòa ước Nhâm Tuất nhường cho Pháp ba tỉnh miền Tây Nam Kỳ, đã có hơn 40 cuộc nổi dậy chống nghèo đói và áp bức, trong đó có cuộc nổi dậy Cao Bá Quát (1854-1856) ở Hà Tây (nay thuộc Hà Nội) là tiêu biểu nhất. Khởi nghĩa Cao Bá Quát cuộc nổi dậy của nông dân dưới triều Tự Đức, thủ lĩnh là Cao Bá Quát. Ông đã tập hợp nghĩa quân nổi dậy ở Mỹ Lương (nay thuộc Mỹ Đức và Chương Mỹ, Hà Tây), tự mình làm quân sư, tôn Lê Duy Cự làm minh chủ",
      "Địa điểm liên quan": [
        "Hà Nội"
      ]
    },
    {
      "name": "Nhà Hán lập Giao Chỉ Bộ (-106 )",
      "description": "Nhà Hán lập Giao Chỉ bộ, cai trị 7 quận (gồm cả Quảng Đông, Quảng Tây và miền Bắc Việt Nam ngày nay). Trung tâm của Giao Chỉ bộ là quận Giao Chỉ - một quận lớn và quan trọng nhất. Trị sở của quận Giao Chỉ là đất Mê Linh (Hạ Lôi, Mê Linh, Vĩnh Phúc). Đứng đầu Châu (Bộ) là chức Thư sử, phụ trách thanh tra công việc của các quận. Mỗi quận có một viên Thái thú và một viên Đô úy (phụ trách dân sự và quân sự). Bên dưới quận là các huyện vẫn do người địa phương nắm giữ và trị dân như cũ. Phương thức bóc lột cơ bản vẫn là cống nạp. Nhà Hán vẫn phải “dùng tục cũ mà cai trị” đối với Âu Lạc.",
      "Địa điểm liên quan": [
        "Giao Chỉ"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Minh Mạng ",
        "Lê Văn Khôi ",
        "Lê văn Duyệt "
      ],
      "name": "Khởi nghĩa Lê Văn Khôi (1833 - 1835)",
      "description": "Khởi nghĩa Lê Văn Khôi là một cuộc nổi dậy chống lại triều đình xảy ra vào thời vua Minh Mạng. Sự kiện này diễn ra từ năm 1833 đến năm 1835 ở các tỉnh miền Nam Việt Nam, lãnh đạo của cuộc nổi dậy này là Lê Văn Khôi, con nuôi của Lê Văn Duyệt.",
      "Địa điểm liên quan": [
        "Gia Định "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Tri Phương "
      ],
      "name": "Thực dân Pháp mở đầu cuộc xâm lược Việt Nam (1858 )",
      "description": "Từ giữa thế kỉ XIX, các nước tư bản phương tây đẩy mạnh việc xâm chiếm các nước phương đông. Sau nhiều lần khiêu khích, lấy cớ bảo vệ đạo Gia Tô, Pháp đem quân xâm lược Việt Nam.",
      "Địa điểm liên quan": [
        "Huế",
        "Đà Nẵng",
        "Bán đảo Sơn Trà"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Phan Thanh Giản ",
        "Lâm Duy Hiệp "
      ],
      "name": "Hiệp ước Nhâm Tuất (1862 )",
      "description": "Hiệp ước Nhâm Tuất được ký ngày 5 tháng 6 năm 1862 tại Sài Gòn giữa đại diện triều Nguyễn (thời vua Tự Đức) là chánh sứ Phan Thanh Giản và phó sứ Lâm Duy Hiệp với đại diện của Pháp là thiếu tướng Bonard và đại diện của Tây Ban Nha là đại tá Don Carlos Palanca Guttiere.",
      "Địa điểm liên quan": [
        "Gia Định ",
        "Đà Nẵng",
        "Định Tường",
        "Biên Hòa ",
        "Vĩnh Long"
      ]
    },
    {
      "name": "Quân Pháp đánh chiếm tỉnh thành Gia Định (1859 - 1859)",
      "description": "Quân Pháp với mong muốn đánh chiếm nhanh Đà Nẵng, rồi sẽ \"giáng cho Huế một đòn quyết định\", để có thể làm chủ nước Đại Nam nhưng vì vấp phải sự kháng cự của nhân dân nên chỉ chiếm được bán đảo Sơn Trà. Bị cầm chân ở Đà Nẵng, tướng Charles Rigault de Genouilly buộc phải thay đổi kế hoạch, là rút đi hai phần ba số quân (tức 2.000 người) và 8 trong số 14 chiến thuyền ở mặt trận này để vào đánh chiếm Gia Định. Tháng 2 năm 1859, liên minh Pháp và Tây Ban Nha đã đưa quân vào để đánh chiếm và phá hủy nhiều công trình quân sự của Vương triều nhà Nguyễn, trong đó có thành Gia Định. Trận đánh thành Gia Định bắt đầu vào rạng sáng ngày 17 tháng 2 năm 1859 và kết thúc khoảng 10 giờ trưa cùng ngày.",
      "Địa điểm liên quan": [
        "Hồ Chí Minh",
        "Gia Định ",
        "Bán đảo Sơn Trà"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Tô Định"
      ],
      "name": "Tô Định làm Thái thú Giao Chỉ (34 )",
      "description": "Tô Định sang làm Thái thú Giao Chỉ thay cho Tích Quang. Tô Định thi hành chính sách cai trị và bóc lột rất tàn bạo đối với người Việt. Bọn Thái thú Tô Định cùng Đốc bưu đốc thúc đồ cống, thu thuế muối, sắt, cùng sản vật thủ công, thuế đánh cá đầm ao,… Không những thế, chúng còn khống chế, đè nén các lạc tướng và con cháu họ. Dân oán hận, quý tộc Âu lạc cũ cũng oán hận chính quyền đô hộ, đã làm bùng nổ những phong trào chống đối ngày càng mạnh mẽ của nhân dân và quý tộc Lạc Việt.",
      "Địa điểm liên quan": [
        "Giao Chỉ"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Hai Bà Trưng ",
        "Tô Định",
        "Thi Sách "
      ],
      "name": "Hai Bà Trưng liên kết Thi Sách chiêu mộ nghĩa binh (39 )",
      "description": "Hai Bà Trưng (Trưng Trắc và Trưng Nhị) con gái Lạc tướng huyện Mê Linh – vùng lãnh thổ từ Ba Vì đến Tam Đảo (Đất bản bộ của các vua Hùng), liên kết với Thi Sách, con trai thủ lĩnh vùng Chu Diên (dọc sông Đáy) chiêu mộ nghĩa binh chuẩn bị nổi lên chống chính quyền đô hộ Đông Hán. Lãnh thổ Mê Linh và Chu Diên liền cõi, hai gia đình Lạc tướng lại là thông gia, khiến thanh thế của họ càng thêm cao, uy danh càng thêm lớn. Chính sách cai trị thắt buộc, tàn bạo của nhà Đông Hán – với viên Thái thú Tô Định – càng thôi thúc Trưng Trắc, Thi Sách hợp mưu tính kế nổi dậy.",
      "Địa điểm liên quan": [
        "Mê Linh"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh ",
        "Phạm Hồng Thái ",
        "Hồ Tùng Mậu ",
        "Lê Hồng Phong ",
        "Lê Hồng Sơn "
      ],
      "name": "Thành lập tổ chức Tâm Tâm Xã tại Quảng Châu Trung Quốc (1923 )",
      "description": "Năm 1923, tại Quảng Châu, Trung Quốc do bất đồng với tư tưởng bảo thủ của cánh già trong Việt Nam Quang phục Hội, Lê Hồng Phong, Hồ Tùng Mậu, Phạm Hồng Thái... đã thành lập Tâm Tâm Xã với tôn chỉ: \"Liên hiệp những người có tri thức trong toàn dân Việt Nam, không phân biệt ranh giới, đảng phái; miễn là có quyết tâm hi sinh tất cả tư ý và quyền lợi cá nhân, đem hết sức mình tiến hành mọi việc để khôi phục quyền làm người của người Việt Nam\"."
    },
    {
      "Nhân vật liên quan": [
        "Phạm Hồng Thái ",
        "Lê Hồng Sơn "
      ],
      "name": "Phạm Hồng Thái mưu sát toàn quyền Đông Dương tại Sa Diện (1924 )",
      "description": "Nhằm tăng cường mối quan hệ kinh tế cũng như sự câu kết về chính trị với các nước láng giềng của Đông Dương, đặc biệt là với các địa bàn có phong trào yêu nước của người Việt Nam hoạt động, Toàn quyền Đông Dương Meclanh đã thực hiện hàng loạt các cuộc viếng thăm Vân Nam phủ (4-4-1924), Nhật (từ 16-4)… Trên đường từ Nhật trở về Đông Dương, Meclanh ghé thăm khu tô giới của Pháp ở Quảng Châu, một trung tâm rất sôi động của các tổ chức cách mạng của người Việt Nam. Nhân cơ hội này, tổ chức Tâm tâm xã quyết định trừng trị tên thực dân đầu sỏ Meclanh để gây thanh thế. Phạm Hồng Thái được sự hổ trợ của Lê Hồng Sơn được giao thực hiện sứ mạng này."
    },
    {
      "Nhân vật liên quan": [
        "Ngô Quyền ",
        "Dương Tam Kha",
        "Ngô Xương Văn ",
        "Ngô Xương Ngập ",
        "Ngô Xương Xí"
      ],
      "name": "Loạn 12 sứ quân (965 - 967)",
      "description": "Loạn 12 hình thành và phát triển mạnh từ khi Dương Tam Kha cướp ngôi nhà Ngô, các nơi không chịu thuần phục, các thủ lĩnh nổi lên cát cứ một vùng và đem quân đánh chiếm lẫn nhau. Loạn 12 sứ quân kéo dài hơn 20 năm (944-968) và kết thúc khi Đinh Bộ Lĩnh thống nhất đất nước, lập ra nhà nước Đại Cồ Việt - nhà nước phong kiến tập quyền đầu tiên trong lịch sử."
    },
    {
      "Nhân vật liên quan": [
        "Phùng Hưng "
      ],
      "name": "Khởi nghĩa Phùng Hưng (776 - 791)",
      "description": "Dưới sự thống trị của nhà Đường, nhân dân ta phải chịu nhiều cực khổ, nhà Đường đặt ra nhiều loại thuế như thuế muối, thuế sắt, thuế đay, gai, tơ lụa...Hàng năm dân ta phải cống nạp những sản vật quý hiếm như ngọc trai, ngà voi, sừng tê, đồi mồi, trầm hương, vàng, bạc...Căm ghét chính sách thống trị của quan lại nhà Đường, và nhân lòng căm phẫn của nhân dân, lợi dụng khi quân lính ở Tống Bình nổi loạn, Phùng Hưng đã phát động một cuộc khởi nghĩa lớn chống chính quyền đô hộ chống chính quyền đô hộ nhà Đường."
    },
    {
      "Nhân vật liên quan": [
        "Mai Hắc Đế "
      ],
      "name": "Khởi nghĩa Mai Thúc Loan (713 )",
      "description": "Khoảng cuối những năm 10 của thế kỉ VIII, Mai Thúc Loan kêu gọi những người dân phu đã cùng ông phải đi gánh vải quả nộp cống cho chính quyền nhà Đường nổi dậy khởi nghĩa. Được nhân dân khắp vùng Thanh, Nghệ Tĩnh hưởng ứng, nghĩa quân trở nên đông đảo, mạnh mẽ."
    },
    {
      "Nhân vật liên quan": [
        "Hồ Quý Ly ",
        "Hồ Hán Thương ",
        "Hồ Nguyên Trừng "
      ],
      "name": "Định quan chế và hình luật của nước Đại Ngu (1401 )",
      "description": "Năm 1401, Hồ Hán Thương \"định quan chế về hình luật nước Đại Ngu\". Nếu như pháp luật hình sự thời kỳ nhà Lý còn mang nhiều tính khoan dung, đến pháp luật hình sự thời kỳ nhà Trần đã mang tính nghiêm khắc hơn, thì đến thời kỳ nhà Hồ, để khôi phục kỷ cương và củng cố uy quyền của nhà nước phong kiến, chế tài hình sự được áp dụng đã mang tính chất hà khắc, nặng nề hơn các triều đại trước rất nhiều."
    },
    {
      "Nhân vật liên quan": [
        "Hồ Quý Ly ",
        "Hồ Hán Thương "
      ],
      "name": "Chiến tranh Việt Chiêm 1400-1407 (1400 - 1407)",
      "description": "Từ cuối thế kỷ 14, Chiêm Thành dưới thời Chế Bồng Nga đã nhiều lần tấn công Đại Việt khiến nhà Trần phải bỏ kinh thành Thăng Long. Khi Chế Bồng Nga tử trận năm 1390, những cuộc tấn công từ phía nam mới lắng xuống. Các con Chế Bồng Nga là Chế Ma Nô Đà Nan và Chế Sơn Na bị tướng La Ngai giành ngôi, yếu thế phải chạy sang đầu hàng Đại Việt. Sau khi Hồ Quý Ly lên ngôi, lập ra nước Đại Ngu, nhà Hồ đã chủ trương đánh Chiêm Thành để mở rộng đất đai về phía nam."
    },
    {
      "Nhân vật liên quan": [
        "Hồ Quý Ly "
      ],
      "name": "Cuộc xâm lược của nhà Minh 1406-1407 (1406 - 1407)",
      "description": "Tháng 11-1406, lấy cớ nhà Hồ cướp ngôi nhà Trần, nhà Minh đã huy động một lực lượng lớn gồm 20 vạn quân cùng với hàng chục vạn dân phu, do tướng Trương Phụ cầm đầu tiến vào nước ta.",
      "Địa điểm liên quan": [
        "Thăng Long "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Trần Nghệ Tông ",
        "Nguyễn cảnh Chân ",
        "Đặng Tất "
      ],
      "name": "Cuộc khởi nghĩa Trần Ngỗi (1407 - 1409)",
      "description": "Tháng 11-1406, quân Minh sang xâm lược nước ta. Sau thất bại của nhà Hồ, nhân dân ta ở nhiều nơi đã nổi dậy khởi nghĩa trong đó có cuộc khởi nghĩa của Trần Ngỗi. Trần Ngỗi vốn là con thứ của vua Trần Nghệ Tông, ông được một người yêu nước là Trần Triệu Cơ đưa lên làm minh chủ, Trần Ngỗi tự xưng là Giản Định hoàng đế.",
      "Địa điểm liên quan": [
        "Nghệ An"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh "
      ],
      "name": "Nguyễn Ái Quốc đến Quảng Châu (Trung Quốc) (1924 )",
      "description": "Với sự giúp đỡ của Quốc tế Cộng sản, Nguyễn Ái Quốc được bố trí trong phái đoàn cố vấn của chính phủ Liên Xô do Bôrôđin dẫn đầu tới Quảng Châu giúp Chính phủ Dân quốc của Tôn Dật Tiên. Ngày 11-11-1924, Nguyễn Ái Quốc tới Quảng Châu (Trung Quốc)"
    },
    {
      "Nhân vật liên quan": [
        "Trần Nghệ Tông ",
        "Nguyễn cảnh Chân ",
        "Đặng Tất ",
        "Trùng Quang Đế ",
        "Giản Định Đế "
      ],
      "name": "Cuộc khởi nghĩa Trần Quý Khoáng (1409 - 1414)",
      "description": "Sau khi cuộc kháng chiến của nhà Hồ bị thất bại, tiếp theo là cuộc khởi nghĩa của Trần Ngỗi bị tan rã, hai tướng Đặng Tất, Nguyễn Cảnh Chân bi Trần Ngỗi giết chết, con trai của Đặng Tất, Nguyễn Cảnh Chân là Đặng Dung và Nguyễn Cảnh Dị cùng nhiều nghĩa quân bỏ vào Nghệ An, đưa Trần Quý Khoáng (con của Trang Định vương Trần Ngạc, cháu nội vua Trần Nghệ Tông) lên ngôi vua, lấy hiệu là Trùng Quang đế và phát động khởi nghĩa.",
      "Địa điểm liên quan": [
        "Nghệ An",
        "Thanh Hóa"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Hai Bà Trưng ",
        "Mã Viện "
      ],
      "name": "Nhà Hán cử Mã Viện cùng với Đoàn Chí đem quân sang đánh Trưng Vương (-41 )",
      "description": "Nhà Hán trước việc Hai Bà Trưng nổi binh đánh đuổi quan quân cai trị và làm chủ các thành ấp, bèn hạ lệnh cho các quận Trường Sa, Hợp Phố, Giao Chỉ sắm sửa xe thuyền, sửa sang đường cầu thông các khe núi, trữ thóc lương và cữ Mã Viện, một viên tướng có nhiều kinh nghiệm chiến trận làm Phục Ba tướng quân, cùng với Lâu thuyền tướng quân sang đánh Trưng Vương. Quân Hán có chừng hai vạn người lấy ở các miền Trường Sa, Quế Dương, Linh Lăng, Thương Ngô cùng với thủy quân khoảng 2000 thuyền lớn nhỏ tiến sang đánh dẹp Trưng Vương.",
      "Địa điểm liên quan": [
        "Giao Chỉ"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Ngô Quyền ",
        "Dương Tam Kha",
        "Đinh Tiên Hoàng ",
        "Đinh Công Trứ"
      ],
      "name": "Đinh Bộ Lĩnh dẹp loạn 12 sứ quân, thống nhất đất nước, lên ngôi vua (968 )",
      "description": "Năm 944 Ngô Quyền mất, năm 945 Dương Tam Kha chiếm ngôi. Nhiều quan lại cựu thần của Ngô Quyền đã nổi lên chống lại Dương Tam Kha, thổ hào các nơi cũng đua nhau nổi dậy. Từ năm 966, hình thành đầy đủ 12 sứ quân chiếm giữ các địa phương. Trong hoàn cảnh nói trên, Đinh Bộ Lĩnh đã liên kết với sứ quân Trần Lãm, chiêu dụ được sứ quân Phạm Bạch Hổ, tiến đánh các sứ quân khác.",
      "Địa điểm liên quan": [
        "Hoa Lư "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Trãi ",
        "Lê Lai ",
        "Lê Thái Tổ "
      ],
      "name": "Khởi nghĩa Lam Sơn (1418 - 1427)",
      "description": "Sau khi nhà Minh tiêu diệt nhà Hồ, nhân dân ta đã nổi dậy ở nhiều nơi như cuộc khởi nghĩa của Trần Ngỗi, cuộc khởi nghĩa của Trần Quý Khoáng. Tuy nhiên các cuộc khởi nghĩa này lần lượt thất bại. Trước cảnh nước mất, nhân dân lầm than, Lê Lợi một hào trưởng vùng Lam Sơn (Thanh Hóa) đã dốc hết tài sản dể chiêu tập nghĩa sĩ, bí mật liên lạc với các hào kiệt, xây dựng lực lượng và chọn Lam Sơn làm căn cứ cho cuộc khởi nghĩa. Nghe tin Lê Lợi chuẩn bị khởi nghĩa ở Lam Sơn, nhiều người yêu nước tìm về càng đông, trong đó có Nguyễn Trãi. Ngày 2 tháng 1 năm Mậu Tuất (7-2-1418), Lê Lợi dựng cờ khởi nghĩa ở Lam Sơn và tự xưng là Bình Định Vương.",
      "Địa điểm liên quan": [
        "Nghệ An",
        "Thanh Hóa",
        "Thuận Hóa",
        "Núi Chí Linh",
        "Ải Chi Lăng",
        "Tốt Động"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lê Thái Tổ ",
        "Nguyễn Chích "
      ],
      "name": "Quân Lam Sơn giải phóng Nghệ An (1424 )",
      "description": "Năm 1416, Lê Lợi và các cộng sự mở Hội thề Lũng Nhai, bắt đầu khởi nghĩa chống quân Minh xâm lược. Ban đầu nghĩa quân lập chiến khu ở vùng núi Lam Sơn (Thanh Hóa) nhưng lực lượng mỏng lại bị quân Minh trấn áp quyết liệt, nên phải rút về lập chiến khu mới ở vùng núi Chí Linh. Tại Chí Linh, quân Việt tiếp tục gặp phải khó khăn về lương thực và lực lượng, bị quân Minh tấn công dữ dội. Sau thời gian tạm hòa, cuối năm 1424 quân Minh tiến công nghĩa quân. Trước tình hình này, Nguyễn chích đề nghị tạm rời Chí Linh (Thanh Hóa) để chuyển quân về Nghệ An là nơi đất rộng, người đông và cũng rất hiểm yếu, dựa vào đó có thể quay ra đánh lấy Đông Đô",
      "Địa điểm liên quan": [
        "Nghệ An",
        "Thanh Hóa",
        "Núi Chí Linh"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Chủ tịch Hồ Chí Minh ",
        "Hồ Tùng Mậu ",
        "Lê Hồng Sơn "
      ],
      "name": "Nguyễn Ái Quốc thành lập Hội Việt Nam Cách mạng Thanh niên (1925 )",
      "description": "Từ đầu năm 1925, trên cơ sở những hội viên trung kiên của Tâm tâm xã, Nguyễn Ái Quốc đã thành lập “Nhóm bí mật” trong đó có 5 đảng viên cộng sản dự bị và 2 đoàn viên thanh niên cộng sản dự bị. Lấy “Nhóm bí mật” này làm nồng cốt, tháng 6-1925, Nguyễn Ái Quốc thành lập Hội Việt Nam Cách mạng Thanh niên nhằm tổ chức và lãnh đạo quần chúng đoàn kết lại, kịch liệt tranh đấu để đánh đổ đế quốc chủ nghĩa Pháp và tay sai để tự cứu lấy mình."
    },
    {
      "Nhân vật liên quan": [
        "Lê Thái Tổ ",
        "Trần Nguyên Hãn ",
        "Lê Ngân "
      ],
      "name": "Quân Lam Sơn giải phóng Tân Bình, Thuận Hóa và tiến quân ra bắc (1425 - 1426)",
      "description": "Sau khi giải phóng Nghệ An, tháng 8-1425, các tướng Trần Nguyên Hãn, Lê Ngân… được lệnh chỉ huy một lực lượng mạnh từ Nghệ An tiến vào Tân Bình (Quảng Bình, Bắc Quảng Trị) và Thuận Hóa (Thừa Thiên - Huế). Nghĩa quân nhanh chóng đập tan sức kháng cự của quân giặc, giải phóng Tân Bình, Thuận Hóa.",
      "Địa điểm liên quan": [
        "Thăng Long ",
        "Nghệ An",
        "Quảng Bình",
        "Quảng Trị",
        "Thuận Hóa"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lê Đại Hành "
      ],
      "name": "Lê Hoàn đánh bại quân Tống (981 )",
      "description": "Cuối năm 979, Đinh Tiên Hoàng và thế tử Đinh Liễn bị ám sát. Vua mới còn nhỏ, Lê Hoàn được cử làm phụ chính. Một số tướng dấy binh chống lại bị Lê Hoàn đánh bại. Nhân cơ hội đó, nhà Tống lăm le bờ cõi Đại Cồ Việt. Trước tình thế hiểm nghèo, các tướng lĩnh và quân đội suy tôn Lê Hoàn lên làm vua để chỉ huy kháng chiến."
    },
    {
      "Nhân vật liên quan": [
        "Mã Viện "
      ],
      "name": "Mã Viện đánh vào Giao Chỉ (42 )",
      "description": "Bộ binh của Mã Viện và thủy quân của Đoàn Chí gặp nhau ở Hợp Phố. Tại đây, Đoàn Chí mắc bệnh, chết. Vua Hán cho Mã Viện thống suất cả thủy binh và bộ binh theo đường bờ biển tiến vào Giao Chỉ. Thuyền ít, không đủ chỗ cho cả đaịa quân vượt biển. Mã Viện phải tổ chức hành quân trên bộ lẫn trên biển, vừa dùng thuyền vượt biển vừa đi đường núi ven biển. Đoạn quân bộ dọc theo đường núi, phát cây rừng mở đường hơn nghìn dặm dọc theo biển Đông Bắc Giao Chỉ. Từ vùng ven biển vịnh Bái Tử Long và Hạ Long, Mã Viện đưa hai đạo quân thủy bộ ngược sông Bạch Đằng tới Lục Đầu rồi đánh sâu vào Giao Chỉ.",
      "Địa điểm liên quan": [
        "Giao Chỉ"
      ]
    },
    {
      "name": "Hơn 2000 dân Tượng Lâm quận Nhật Nam khởi nghĩa chống chính quyền đô hộ nhà Hán (100 )",
      "description": "Mùa hè năm 100, hơn 2.000 dân Tượng Lâm nổi lên phá đồn, đốt thành, giết một số quan quân cai trị. Chính quyền đô hộ Hán phải huy động quân của các quận huyện khác đến dẹp, giết được chủ tướng, cuộc nổi loạn mới tạm yên. Từ đó chính quyền nhà Hán không dám ức hiếp một cách thô bạo dân cư tại đây nhưng đặt vùng đất này dưới quyền cai trị trực tiếp, do một binh trưởng sứ cầm đầu, đề phòng những cuộc nổi loạn sau này. Để lấy lòng dân cư địa phương, quan quân nhà Hán tổ chức phát chẩn cho dân nghèo, miễn thuế hai năm v.v.",
      "Địa điểm liên quan": [
        "Nhật Nam",
        "Tượng Lâm "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lê Đại Hành "
      ],
      "name": "Lê Hoàn lên ngôi, lập nhà Tiền Lê, đóng đô ở Hoa Lư (980 - 1009)",
      "description": "Sau khi Đinh Tiên Hoàng và con là Đinh Liễn bị ám hại, Vệ Vương Toàn lên làm vua, Lê Hoàn làm phụ chính, xưng là Phó Vương. Triều thần sợ Lê Hoàn cướp ngôi vua nhỏ, Định Quốc Công Nguyễn Bặc và ngoại giáp Đinh Điền dẫn quân về kinh đô định giết Lê Hoàn, thua trận bị Lê Hoàn giết. Năm 980, quân Tống nhân cơ hội đem quân sang muốn cướp nước, triều thần và thái hậu Dương Vân Nga đưa Lê Hoàn lên làm vua (vua Lê Đại Hành) lập ra nhà Tiền Lê, đổi niên hiệu là Thiên Phúc, đóng đô ở Hoa Lư. Nhà Tiền Lê trải qua ba đời vua và chấm dứt khi Lê Ngọa Triều qua đời, hoàng tử kế vị đang còn nhỏ tuổi và được kế tục bởi nhà Lý.",
      "Địa điểm liên quan": [
        "Hoa Lư "
      ]
    },
    {
      "name": "Khởi nghĩa ở quận Nhật Nam (137 )",
      "description": "Dân và quân lính ở ba quận miền Nam Giao Chỉ khởi nghĩa. Từ đầu năm 137, nhân dân cả quận Nhật Nam nổi dậy, quân số chừng vài nghìn người, đánh phá chính quyền đô hộ nhà Hán ở Nhật Nam.",
      "Địa điểm liên quan": [
        "Nhật Nam",
        "Giao Chỉ",
        "Cửu Chân"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Sĩ Tiếp "
      ],
      "name": "Nhà Hán suy yếu Nho giáo bắt đầu du nhập vào nước ta (187 )",
      "description": "Trong thế kỷ II, nhân dân các quận ở Giao Chỉ luôn nổi dậy khởi nghĩa làm cho triều đình nhiều phen lo đánh dẹp. Cuối thế kỷ II, nhà Hán suy yếu, chúng buộc phải tạm dùng người Việt cầm đầu chính quyền ở Giao Chỉ. Hán Linh Đế cử Lý Tiến, người quận Giao Chỉ làm thứ sử và sai Sĩ Nhiếp, người quận Thương Ngô làm Thái thú. Lý Tiến làm Thứ sử đến năm 200, còn Sĩ Nhiếp cầm quyền tới năm 226. Dưới thời cai trị của Sĩ Nhiếp, nhiều quan lại và dân chúng người Hán lánh nạn sang nước ta. Cùng với các danh sĩ và dân di cư đó, văn hóa Trung Hoa, đặc biệt là Nho giáo bắt đầu du nhập vào Giao Chỉ.",
      "Địa điểm liên quan": [
        "Giao Chỉ"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lê Đại Hành ",
        "Lê Long Đĩnh ",
        "Lý Thái Tổ ",
        "Đào Cam Mộc ",
        "Vạn Hạnh "
      ],
      "name": "Lý Công Uẩn lên ngôi, lập ra nhà Lý (1009 )",
      "description": "Năm 1005, Lê Hoàn mất, Lê Long Đĩnh lên ngôi vua. Cuối 1009 Lê Long Đĩnh qua đời. Triều Đình chán ghét nhà Tiền Lê, vì vậy các tăng sư và đại thần, đứng đầu là Sư Vạn hạnh, Đào Cam Mộc tôn Lý Công Uẩn lên ngôi vua (vua Lý Thái Tổ). Nhà Lý thành lập. Nhà Lý đã trải qua 9 triều vua và chấm dứt khi vua Lý Chiêu Hoàng, lúc đó mới có 7 tuổi bị ép thoái vị để nhường ngôi cho chồng là Trần Cảnh vào năm 1225 – tổng cộng là 216 năm."
    },
    {
      "name": "Nhà nước Lâm Ấp được thành lập (190 )",
      "description": "Huyện Tượng Lâm thuộc quận Nhật Nam ở miền Nam nước ta, cách xa thủ phủ đô hộ của phong kiến Trung Quốc. Nhân lúc Trung Quốc loạn lạc, dân Tượng Lâm ở nơi xa xôi nhất đã nổi dậy, giết huyện lệnh, giành lấy quyền tự chủ và lập nước. Được sự hỗ trợ của nhân dân Giao chỉ, nhân dân Cửu Chân cũng niổi lên đánh phá châu thành, giết Thứ sử nhà Hán là Chu Phù (190), khiến trong mấy năm triều đình nhà Hán không đặt nổi quan cai trị. Khu Liên – một nhà lãnh đạo cuộc khởi nghĩa của nhân dân Tượng Lâm lên làm vua.",
      "Địa điểm liên quan": [
        "Nhật Nam",
        "Tượng Lâm "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Sĩ Tiếp "
      ],
      "name": "Nhà Hán đặt Giao Chỉ thành Giao Châu (203 )",
      "description": "Nhà Hán đặt Giao Chỉ làm Giao Châu. Trước kia đời Hán Thuận Đế (126-144), Thái thú Giao Chỉ là Chu Xưởng xin lập Giao Chỉ làm châu, triều đình nhà Hán không cho. Đến đây, Thứ sử Trương Tân và Thái thú Sĩ Nhiếp cùng nhau dân biểu xin lập Giao Chỉ làm châu để được đối xử ngang hàng với các châu khác của Trung Quốc. Nhà Hán mới đặt Giao Chỉ làm Giao Châu và phong Trương Tân làm quan mục ở Giao Châu. Tên Giao Châu bắt đầu từ đây.",
      "Địa điểm liên quan": [
        "Giao Châu",
        "Giao Chỉ"
      ]
    },
    {
      "Nhân vật liên quan": [
        "An Dương Vương"
      ],
      "name": "Nước Âu lạc bị quân Triệu Đà xâm chiếm (-179 )",
      "description": "Triệu Đà là một tướng của nhà Tần. Năm 207 TCN, nhân lúc nhà Tần suy yếu, Triệu Đà cắt đất ba quận lập nước nam Việt và đem quân đi đánh các vùng xung quang và đánh xuống Âu lạc."
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Trãi ",
        "Lê Thái Tổ "
      ],
      "name": "Trận Tốt Động – Chúc Động (1426 - 1426)",
      "description": "Trận Tốt Động – Chúc Động là trận đánh vào cuối năm năm1426, giữa nghĩa quân Lam Sơn do Lê Lợi chỉ huy với quân nhà Minh đóng ở Đông Quan (tức là Thăng Long, Hà Nội). Đây là một trong những điển hình rực rỡ về quyết tâm tiêu diệt địch, về tinh thần chiến đấu dũng cảm và nghệ thuật quân sự tuyệt vời của nghĩa quân Lam Sơn. Trận này được nhắc đến trong Bình Ngô đại cáo của Nguyễn Trãi:Ninh Kiều máu chảy thành sông, tanh hôi vạn dặm; Tụy Động thây chất đầy nội, nhơ để ngàn năm.",
      "Địa điểm liên quan": [
        "Thăng Long ",
        "Hà Nội",
        "Quảng Bình",
        "Thuận Hóa",
        "Tốt Động"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Hùng Vương",
        "An Dương Vương"
      ],
      "name": "Nước Âu lạc của An Dương Vương thành lập (-207 )",
      "description": "Sau khi chiến thằng quân Tần, Thục Phán buộc Hùng Vương nhường ngôi cho mình. Hai vùng đất cũ của người Tây Âu và Lạc Việt được hợp thành nước mới có tên là Âu Lạc. Thục phán lên làm vua, tự xưng là An Dương Vương, đóng đô ở Phong Khê (nay là vùng Cổ Loa, huyện Đông Anh, Hà Nội)",
      "Địa điểm liên quan": [
        "Cổ Loa"
      ]
    },
    {
      "Nhân vật liên quan": [
        "An Dương Vương"
      ],
      "name": "Kháng chiến chống quân xâm lược Tần (-214 - -208)",
      "description": "Vào cuối thế kỉ III TCN - đời vua Hùng thứ 18, đất nước Văn Lang không còn bình yên nữa. \"vua không lo sửa sang võ bị chỉ ham chơi, ăn uống, lụt lội xảy ra, đời sống nhân dân gặp nhiều khó khăn. Trong khi đó ở phương Bắc nhà Tần thống nhất Trung Nguyên. Năm 218 TCN, vua Tần sai quân đánh xuống phương Nam để mở rộng bờ cõi. Sau 4 năm chinh chiến, quân Tần đánh xuống Bắc Văn Lang nơi người Lạc Việt và Tây Âu đang sinh sống. Cuộc kháng chiến bùng nổ, thủ lĩnh Tây Âu bị giết. Người Việt trốn vào rừng và tôn một người tuấn kiệt là Thục Phán lên làm tướng. Cuộc chiến đấu kiên cường của cư dân Tây Âu-Lạc Việt đã đại phá quân Tần, giết Hiệu úy Đồ Thư. Nhà Tần phải bãi binh."
    },
    {
      "Nhân vật liên quan": [
        "Lý Thái Tông "
      ],
      "name": "Nhà Lý ban hành bộ luật Hình thư (1042 )",
      "description": "Năm 1042, nhà Lý biên soạn và cho ban hành bộ luật Hình thư (hiện nay không còn nữa), đây là bộ luật thành văn đầu tiên của nước ta. Bộ Hình thư ra đời thay thế cho các quy chế, luật lệ, chiếu chỉ trước đó. Theo Đại Việt sử kí toàn thư: “Trước kia, trong nước, việc kiện tụng phiền nhiễu, quan giữ việc hình câu nệ luật văn, cốt làm khắc nghiệt, thậm chí bị oan uổng. Vua lấy làm thương xót, sai sửa định luật lệnh, châm chướt cho, thích dụng với thời bấy giờ, chia ra môn loại, biên ra điều khoảng làm sách hình luật của mọi triều đại để cho người xem dễ biết. Sách làm xong, chiếu ban ra cho thi hành, dân đều lấy làm tiện”. Theo Lê Quý Đôn trong Đại Việt thông sử thì Hình thư đời Lý Thái Tông gồm có ba quyển, bây giờ thất truyền."
    },
    {
      "Nhân vật liên quan": [
        "Lý Thái Tổ "
      ],
      "name": "Lý Thái Tổ dời đô về Đại la, đổi tên thành Thăng Long (1010 )",
      "description": "Cuối năm 1009, Lý Công Uẩn lên ngôi, nhà Lý thành lập. Năm 1010 Lý Công Uẩn đặt niên hiệu là Thuận Thiên, ông ban hành chiếu dời đô để chuyển kinh đô nước Đại Cồ Việt từ Hoa Lư (Ninh Bình) vể Đại La (Hà Nội ngày nay) và đổi tên thành là Thăng Long. Thời Lý, kinh thành Thăng Long đã dần trở thành đô thị phồn thịnh và có quy mô lớn trong cả khu vực và trên thế giới.",
      "Địa điểm liên quan": [
        "Hoa Lư "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lý Thánh Tông "
      ],
      "name": "Nhà Lý đổi tên nước thành Đại Việt (1054 )",
      "description": "Năm 1054, vua Lý Thánh Tông đổi tên nước là Ðại Việt. Quốc hiệu Đại Việt tồn tại tổng cộng trong thời gian 723 năm, từ năm 1054 đến năm 1400, và từ năm 1428 đến năm 1804. Tên gọi Đại Việt được dùng làm quốc hiệu trong thời kỳ cai trị của các chính quyền nhà Lý, nhà Trần, nhà Hậu Lê, nhà Mạc, Đàng Ngoài, Đàng Trong, nhà Tây Sơn và 3 năm đầu thời nhà Nguyễn (1802 - 1804)"
    },
    {
      "Nhân vật liên quan": [
        "Khúc Thừa Dụ ",
        "Khúc Hạo "
      ],
      "name": "Khúc Thừa Dụ khởi nghĩa giành chính quyền tự chủ (905 )",
      "description": "Từ cuối thế kỉ thứ IX, triều đại nhà Đường sắp sụp đổ, Trung Quốc rơi vào thời kỳ đại loạn sử cũ gọi là thời kỳ Ngũ đại Thập quốc (5 đời 10 nước). Việc cai trị ở An Nam trở nên lỏng lẻo. Nhân cơ hội này, Khúc Thừa Dụ, một hào trưởng có thế lực lâu đời ở đất Hồng Châu (Ninh Giang, Hải Dương), đã nhanh chóng đứng ra lãnh đạo nhân dân nổi lên đánh đuổi bọn đô hộ nhà Đường, đánh chiếm Tống Bình, dựng quyền tự chủ cho đất nước. Khúc Thừa Dụ cũng tự xưng là Tiết độ sứ."
    },
    {
      "Nhân vật liên quan": [
        "Lý Thánh Tông ",
        "Lý Nhân Tông ",
        "Ỷ Lan "
      ],
      "name": "Nhà Lý lập Văn Miếu thờ Khổng Tử (1070 )",
      "description": "Văn Miếu thờ Khổng Tử được xây dựng ở kinh đô Thăng Long vào năm Thần Vũ thứ 2 (1070) đời vua Lý Thánh Tông. Đại Việt sử ký toàn thư chép: \"Mùa thu tháng 8, làm Văn Miếu, đắp tượng, Khổng Tử, Chu Công và Tứ phối, vẽ tượng Thất thập nhị hiền, bốn mùa cúng tế. Hoàng thái tử đến đấy học.\". Văn miếu ngoài chức năng thờ các bậc Tiên thánh, Tiên sư của đạo Nho, còn mang chức năng của một trường học Hoàng gia mà học trò đầu tiên là Thái tử Lý Càn Đức, con trai vua Lý Thánh Tông với Nguyên phi Ỷ Lan, lúc đó mới 5 tuổi, sau này trở thành vua Lý Nhân Tông."
    },
    {
      "Nhân vật liên quan": [
        "Lý Nhân Tông ",
        "Lê Văn Thịnh"
      ],
      "name": "Nhà Lý mở khoa thi đầu tiên, Lê Văn Thịnh đỗ đầu (1075 )",
      "description": "Khoa thi đầu tiên được nhà Lý tổ chức vào tháng 2 năm 1075 thời vua Lý Nhân Tông. Lê Văn Thịnh đỗ đầu cùng hơn 10 người trúng tuyển. Ông trở thành thủ khoa đầu tiên trong lịch sử Việt Nam. Việc mở khoa thi Nho giáo đầu tiên đánh dấu mốc về việc nhà Lý chính thức tuyển người theo Nho giáo làm quan bên cạnh tầng lớp quan lại thiên về kiến thức Phật giáo trước đó."
    },
    {
      "name": "Nhà Đường đổi Giao Châu thành An Nam đô hộ phủ (679 )",
      "description": "Năm 618, nhà Đường được thành lập ở Trung Quốc. Nước ta lại chịu sự thống trị của nhà Đường. Năm 679 nhà Đường đổi Giao Châu thành An Nam đô hộ phủ (sử Trung Quốc bắt đầu gọi ta là An Nam kể từ đó). Với các hình thức và thủ đoạn cai trị xảo quyệt, hà khắc và ngu dân. An Nam đô hộ phủ tương ứng với một phần tây nam Quảng Tây (Trung Quốc), Miền Bắc và miền Trung Việt Nam ngày nay, có địa bàn từ Hà Tĩnh trở ra.",
      "Địa điểm liên quan": [
        "Giao Châu"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lý Nhân Tông ",
        "Trần Thánh Tông "
      ],
      "name": "Lập Quốc tử giám ở kinh đô Thăng Long (1076 )",
      "description": "Quốc tử giám đầu tiên được lập vào năm 1076 tại kinh thành Thăng Long vào thời vua Lý Nhân Tông. Ban đầu, trường chỉ dành riêng cho con vua và con các hoàng tộc, quý tộc và quan lại. Từ năm 1253, vua Trần Thái Tông cho mở rộng Quốc Tử giám và thu nhận cả con cái các nhà thường dân có sức học xuất sắc. Đến đời nhà Nguyễn, quốc tử giám được lập tại Huế. Đứng đầu Quốc tử giám là các chức quan: Tế tửu (tương đương Hiệu trưởng Đại học), Tư nghiệp (tương đương với Hiệu phó)."
    },
    {
      "Nhân vật liên quan": [
        "Lý Thường Kiệt ",
        "Lý Thánh Tông "
      ],
      "name": "Lý Thường Kiệt lãnh đạo kháng chiến chống Tống thắng lợi (1077 )",
      "description": "Từ giữa thế kỉ thứ XI, nhà Tống gặp phải những khó khăn: tài chính nguy ngập, ngân khố cạn kiệt, nội bộ mâu thuẫn, nhân dân đói khổ, nhiều nơi nổi dậy đấu tranh. Vùng biên cương phía bắc của nhà Tống thường xuyên bị hai nước Liêu-Hạ quấy nhiễu. Để giải quyết tình trạng trên, nhà Tống tiến hành xâm lược Đại Việt. Một mặt nhà Tống xúi giục vua Chăm-pa đánh lên từ phía nam, một mặt ngăn cản việc buôn bán, đi lại của nhân dân hai nước, dụ đỗ các tù trưởng dân tộc ít người ở biên giới phía bắc Đại Việt. Sớm phát hiện mưu đồ của kẻ thù, vua nhà Lý cử Lý Thường Kiệt chỉ huy, tổ chức kháng chiến.",
      "Địa điểm liên quan": [
        "Sông Cầu"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lý Chiêu Hoàng ",
        "Trần Thái Tông "
      ],
      "name": "Trần Cảnh lên ngôi vua, nhà Trần thành lập (1226 )",
      "description": "Từ cuối thế kỉ XII, nhà Lý ngày càng suy yếu. Chính quyền không lo đời sống của dân như trước, hầu hết quan lại lao vào ăn chơi sa đọa. Lụt lội, hạn hán liên tiếp xảy ra, dân nghèo phải bán con làm nô tì cho nhà giàu, một số khác phải bỏ vào chùa kiếm sống. Một số thế lực phong kiến ở các địa phương đánh giết lần nhau, quấy phá nhân dân, chống lại triều đình. Nhà Lý phải dựa vào thế lực họ Trần để chống các thế lực nổi loạn. Nhân cơ hội này, họ Trần buộc Chiêu Hoàng phải nhường ngôi cho chồng là Trần Cảnh vào tháng 12 năm Ất Dậu (Đầu năm 1228). Khi đó Trần Cảnh mới 8 tuổi."
    },
    {
      "Nhân vật liên quan": [
        "Lý Nam Đế ",
        "Triệu Việt Vương "
      ],
      "name": "Triệu Quang Phục giành lại độc lập (550 )",
      "description": "Triệu Quang Phục là người có công lớn trong cuộc khởi nghĩa Lý Bí và được Lý Bí rất tin cậy. Sau thất bại ở hồ Điển Triệt, ông được Lý Nam Đế trao quyền chỉ huy cuộc kháng chiến chống quân Lương."
    },
    {
      "Nhân vật liên quan": [
        "Lý Nam Đế "
      ],
      "name": "Nước Vạn Xuân thành lập (544 )",
      "description": "Sau cuộc khởi nghĩa thắng lợi của Lý Bí năm 544, Lý Bí tự xưng là Lý Nam Đế và lên ngôi, đặt niên hiệu là Thiên Đức (đức trời), đặt tên nước là Vạn Xuân (xã tắc truyền đến muôn đời). Ông cho đóng đô ở miền cửa sông Tô Lịch, dựng điện Vạn Thọ làm nơi triều hội."
    },
    {
      "Nhân vật liên quan": [
        "Nguyễn Trãi ",
        "Lê Thái Tổ ",
        "Nguyễn Xí ",
        "Trần Nguyên Hãn ",
        "Đinh Liệt "
      ],
      "name": "Trận Chi Lăng – Xương Giang (1427 - 1427)",
      "description": "Trận Chi Lăng – Xương Giang là một loạt trận đánh nhằm tiêu diệt quân Minh của nghĩa quân Lam Sơn trên địa bàn từ Chi Lăng đến Xương Giang (113 km), kết thúc cuộc khởi nghĩa Lam Sơn và chiến tranh giải phóng chống Minh.",
      "Địa điểm liên quan": [
        "Thăng Long ",
        "Hà Nội",
        "Ải Chi Lăng",
        "Lạng Sơn",
        "Chúc Động"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Lý Nam Đế "
      ],
      "name": "Khởi nghĩa Lý Bí bùng nổ (542 )",
      "description": "Đầu thế kỉ VI, nhà Lương đô hộ Giao Châu. Thứ sử Giao Châu là Tiêu Tư đã đặt ra hàng trăm thứ thuế làm cho nhân dân hết sức cơ cực, lầm than. Lý Bí nhân lòng oán giận của dân, đã liên kết với hào kiệt các châu thuộc miền đất nước ta cùng nổi dậy chống Lương. Triệu Túc là thủ lĩnh đất Chu Diên, Phạm Tu là một tướng tài người làng Thanh Liệt (Thanh Trì, Hà Nội) đã sớm đến với cuộc khởi nghĩa. Tháng giêng năm 542, cuộc khởi nghĩa toàn dân do Lý Bí lãnh đạo đã bùng nổ."
    },
    {
      "Nhân vật liên quan": [
        "Lê Thái Tổ "
      ],
      "name": "Lê Lợi lên ngôi vua ở Đông đô, đặt lại quốc hiệu là Đại Việt (1428 )",
      "description": "Sau khi chiến thắng quân Minh, Năm 1428 Lê Lợi lên ngôi Hoàng đế, tức vua Lê Thái Tổ, chính thức dựng lên triều Hậu Lê. Ông khôi phục quốc hiệu Đại Việt, đóng đô ở Thăng Long và đổi tên Thăng Long thành Đông Đô vào năm Thuận Thiên thứ hai",
      "Địa điểm liên quan": [
        "Thăng Long "
      ]
    },
    {
      "Nhân vật liên quan": [
        "Bà Triệu "
      ],
      "name": "Khởi nghĩa Bà Triệu (248 )",
      "description": "Khi nhà Ngô xâm lược đất nước, chế độ áp bức và bóc lột của nhà Ngô trên nước ta vô cùng tàn bạo. Khi được vua Ngô cử sang làm thứ sử nước ta, Chu Phù và bọn tay chân của hắn ngang ngược hoành hành, thẳng tay cướp bóc tài sản của nhân dân Việt Nam. Nhân dân ta bị cưỡng bức phải đi kiếm các thứ như hương thơm, hạt trai, ngọc lưu ly, đồi mồi, ngà voi nộp cho vua Ngô. Mùa nào thức ấy, nhân dân ta còn phải nộp các thứ quả lạ như chuối tiêu, dứa, nhãn… để cung đốn cho bọn quan lại nhà Ngô. Không cam chịu áp bức bóc lột, dân ta đã nổi lên ở nhiều nơi. Giữa thế kỉ III, ở quận Cửu Chân đã nổi lên cuộc khởi nghĩa của bà Triệu. Năm 19 tuồi bà đã cùng anh trai Triệu Quốc Đạt một hào trưởng lớn ở miền núi Quan yên, thuộc quận Cửu Chân (Yên Định, Thanh Hóa) tập hợp nhiều nghĩa sĩ trên đỉnh núi Nưa, mài gươm luyện võ, chuẩn bị khởi nghĩa.",
      "Địa điểm liên quan": [
        "Thanh Hóa"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Hai Bà Trưng "
      ],
      "name": "Kháng chiến của nhân dân ta chống quân xâm lược Hán (42 - 43)",
      "description": "Sau cuộc khởi nghĩa của Hai Bà Trưng, vua Hán nổi giận hạ lệnh cho các quận miền Nam Trung Quốc chuẩn bị xe, thuyền, làm thêm đường sá, tích trữ lương thực để sang đàn áp nghĩa quân. Năm 42, Quang Vũ sai Phục ba tướng quân Mã Viện, Lâu thuyền tướng quân là Đoàn Chí đem quân ở các miền Quế Dương, Linh Lăng, Thương Ngô sang nước Âu Lạc đánh Trưng Vương.",
      "Địa điểm liên quan": [
        "Giao Chỉ"
      ]
    },
    {
      "Nhân vật liên quan": [
        "Hai Bà Trưng "
      ],
      "name": "Khởi nghĩa Hai Bà Trưng bùng nổ (40 )",
      "description": "Dưới ách đô hộ của nhà Đông Hán, nhân dân Âu Lạc càng bị áp bức bóc lột nặng nề hơn. Năm 34, Tô Định thay Tích Quang làm Thái thú Giao Chỉ. Tên này ra sức đốc thúc nhân dân nộp, cống, thuế. Chúng thẳng tay trừng trị những người có tư tưởng và hành vi chống lại chính quyền. Mâu thuẫn giữa tầng lớp nhân dân Giao Chỉ với chính quyền đô hộ nói chung và cá nhân Thái thú Tô Định nói riêng ngày càng sâu sắc. Đầu năm 40, cuộc khởi nghĩa do Hai Bà Trưng lãnh đạo đã bùng nổ ở Hát Môn (cửa sông Hát, huyện Phúc Thọ, Hà Tây). Dưới ngọn cờ của hai chị em Trưng Trắc, Trưng Nhị, nhân dân cả nước đã nổi dậy hưởng ứng."
    },
    {
      "Nhân vật liên quan": [
        "Lê Thái Tổ ",
        "Lê Thái Tông ",
        "Lê Thánh Tông "
      ],
      "name": "Lê Thánh Tông cho biên soạn và ban hành bộ luật Hồng Đức (1483 )",
      "description": "Dưới thời vua Lê Thái Tổ, Lê Thái Tông, Lê Nhân Tông, pháp luật đã được chú ý xây dựng. Năm 1483 vua Lê Thánh Tông cho biên soạn và ban hành bộ luật mới gọi là bộ Quốc triều hình luật hay Luật Hồng Đức."
    },
    {
      "Nhân vật liên quan": [
        "Trần Thái Tông ",
        "Trương Hán Siêu ",
        "Nguyễn Trung Ngạn "
      ],
      "name": "Ban hành Quốc triều hình luật (1230 )",
      "description": "Năm 1230, Trần Thái Tông ban hành bộ Quốc triều thông chế gồm 20 quyển, quy định về tổ chức chính quyền. Sau đó qua vài lần sửa chữa bổ sung lại ban hành bộ Quốc triều hình luật. Bộ luật này là do Nguyễn Trung Ngạn và Trương Hán Siêu biên soạn. Nhà Trần đặt cơ quan thẩm hình viện để xét xử việc kiện cáo. Vua Trần để chuông lớn ở thềm điện Long Trì cho dân đền kêu oan khi cần. Sự tách biệt giữa vua, quan và dân chúng chưa thực sự sâu sắc."
    }
  ]
}